Repository: franzholz/TYPO3.ext.chgallery
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: nl

# tt_content.list_type_pi1
source: Simple gallery - chgallery
nl: Eenvoudige gallery - chgallery

# show
source: Display
nl: Toon

# show.list
source: CATEGORY view => Categories (subdirs)
nl: CATEGORY aanzicht => Categorien (subfolders)

# show.gallery
source: GALLERY view => Images of a dir
nl: GALLERY aanzicht => Foto's uit een folder

# show.single
source: SINGLE view => Single image
nl: ENKEL aanzicht => Enkele foto

source: Settings
nl: Instellingen

source: Path
nl: Pad

# pagebrowser
source: Images / page
nl: Foto's / pagina

source: Description
nl: Omschrijving

# random
source: Random Mode
nl: Random Modus

# link
source: Link all images to
nl: Link alle foto's naar

# width
source: Image width
nl: Foto breedte

# height
source: Image height
nl: Foto hoogte

# title
source: Category title & description
nl: Category titel & omschrijving

# descriptionList
source: Description
nl: Omschrijving

# single
source: Use Single view
nl: Gebruik Enkel aanzicht

# categoryOrder
source: Sorting of categories
nl: Categorie volgorde

# more
source: Additional options
nl: Optionele instellingen

# renderAllLinks
source: Show all images in Lightbox
nl: Toon alle foto's in een Lightbox

# excludeFirstImage
source: Don't display first image in single view (Category view only)
nl: De eerste foto niet tonen bij gebruik van de Categorie weergave
