Repository: franzholz/TYPO3.ext.chgallery
Catalog: Resources/Private/Language/Wizard/*.locallang.xlf
Languages: de, fr

# images
source: %s Images of the directory "%s"
de: %s Bilder aus dem Verzeichnis "%s"
fr: %s images du répertoire "%s"

# save
source: Save & Close
de: Speichern & Schließen
fr: Enregistrer & Fermer

# save2
source: Save
de: Speichern
fr: Enregistrer

# close
source: Close window
de: Fenster schließen
fr: Fermer la fenêtre

# error-header
source: An error occurred
de: Achtung!
fr: Une erreur est survenue !

# error-neversavesd
source: Please save the plugin once and also a path!
de: Bitte das Plugin zumindest 1x mit einem gültigen Pfad speichern
fr: Veuillez enregistrer le plugin au moins 1x avec un chemin valide

# error-path
source: No path is defined!
de: Kein Pfad angegeben!
fr: Aucun chemin n'a été défini !

# error-pathwrong
source: The path is not valid!
de: Kein gültiger Pfad angegeben!
fr: Le chemin n'est pas valide !

# path
source: Wizard for %s galleries, subfolders of %s
de: Wizard für %s Galerien, Unterordner von %s
fr: Assistant pour %s galeries, sous-répertoires de %s

# title
source: Titel
fr: Titre

# description
source: Click at the title of the subdirectory to open the images of this directory. Fill out the descriptions you need and press close!
de: Klicke auf den Namen des Unterverzeichnisses, um die zugehörigen Bilder zu öffnen. Gib eine Beschreibung ein und klicke am Ende auf 'Speichern'.
fr: Cliquez sur le titre d'un sous-répertoire pour ouvrir les images de ce répertoire. Remplissez les descriptions et terminez en cliquant sur 'Enregistrer'.
