Repository: franzholz/TYPO3.ext.chgallery
Catalog: Resources/Private/Language/Pi1/*.locallang.xlf
Languages: fo

# pi_list_browseresults_displays
source: Page <span class="chgcurrent">###CURRENT_PAGE###</span> of <span class="chgtotal">###TOTAL_PAGES###</span>
fo: Síða <span class="chgcurrent">###CURRENT_PAGE###</span> av <span class="chgtotal">###TOTAL_PAGES###</span>

# pi_list_browseresults_next
source: Next Page
fo: Næsta síða

# pi_list_browseresults_prev
source: Previous Page
fo: Undanfarna síða

# pi_list_browseresults_first
source: Back to the overview
fo: Aftur til yvirlit

# pi_list_browseresults_last
source: Last Page
fo: Síðsta síða

# dir_back
source: Back to the gallery list
fo: Aftur til yvirlit

# size
source: Number of images
fo: Tal av myndum

source: Path
fo: Sló

# name
source: Directory
fo: Mappa

source: Date
fo: Dato

source: Description
fo: Frágreiing

# exif_size
source: Size
fo: Stødd

# exif_time
source: Time
fo: Tíðspunkt

# filename
source: File
fo: Fíl

source: Previous image
fo: Undanfarna mynd

source: Next image
fo: Næsta mynd
